-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 09 月 23 日 13:34
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 8.0.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `BlingBling`
--

-- --------------------------------------------------------

--
-- 資料表結構 `brand`
--

CREATE TABLE `brand` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `brand`
--

INSERT INTO `brand` (`sid`, `name`) VALUES
(1, 'CLARINS 克蘭詩'),
(2, 'maternea 媽咪莉娜'),
(3, 'LASSIG'),
(4, 'Mamaway'),
(5, 'Fammile'),
(6, 'hegen'),
(7, 'coccoafei'),
(8, 'PUREST'),
(9, 'La Millou'),
(10, '小獅王辛巴'),
(11, 'studioCLIP'),
(12, 'GLOBAL WORK'),
(13, 'niko and ...'),
(14, 'BABYLONE'),
(15, 'BAYFLOW'),
(16, 'LAKOLE'),
(17, 'BAGEBLUE'),
(18, 'O0u'),
(19, 'HARE'),
(20, 'Heather'),
(21, 'JEANASiS'),
(22, 'Tommy Hilfiger'),
(23, 'pidan'),
(24, 'Vetreska'),
(25, 'LazyEazy'),
(26, 'Meri Meri'),
(27, 'Clinique'),
(28, 'Divoom'),
(29, 'Marshall'),
(30, 'LANCOME'),
(31, 'Audio Technica'),
(32, 'Estee Lauder 雅詩蘭黛'),
(33, 'JBL'),
(34, 'Leopold'),
(35, 'CLARINS 克蘭詩'),
(36, 'AZIO'),
(37, 'Ducky'),
(38, 'NZXT'),
(39, 'SteelSeries'),
(40, 'logitech'),
(41, 'ORIGINS 品木宣言'),
(42, 'Final'),
(43, 'Sony'),
(44, 'Beyerdynamic'),
(45, 'AKG'),
(46, 'Sennheiser'),
(47, 'Biotherm 碧兒泉'),
(48, 'Kodak'),
(49, 'lomography'),
(50, 'Kiehl’s 契爾氏'),
(51, 'RICOH'),
(52, 'Elizabeth Arden 伊麗莎白'),
(53, 'M.A.C'),
(54, 'YSL'),
(55, 'Bobbi Brown 芭比波朗'),
(56, 'CHANEL 香奈兒'),
(57, '王品集團'),
(58, '星巴克'),
(59, '凱撒大飯店'),
(60, 'Movenpick 莫凡彼'),
(61, 'LEPSIM'),
(62, 'ALAND'),
(63, 'PURROOM'),
(64, 'POPOCOLA'),
(65, 'mao'),
(66, 'PURLAB'),
(67, 'PETHROOM'),
(68, 'zeze'),
(69, '汪喵星球'),
(70, 'PETSEEK'),
(71, '檜沐先生'),
(72, 'CHONLDER'),
(73, 'AiMOE'),
(74, 'Now'),
(75, '好味小姐'),
(76, '自然食'),
(77, '陪心寵糧'),
(78, '毛孩食務所'),
(79, 'BITE ME'),
(80, 'KOJIMA'),
(81, 'enabot'),
(82, 'kashima'),
(83, 'Elura'),
(84, 'BARNYARDSTORM'),
(85, 'RAGEBLUE');

-- --------------------------------------------------------

--
-- 資料表結構 `class`
--

CREATE TABLE `class` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `parent` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `class`
--

INSERT INTO `class` (`sid`, `name`, `parent`) VALUES
(1, '美妝保養', 0),
(2, '流行時尚', 0),
(3, '數位家電', 0),
(4, '母嬰幼兒', 0),
(5, '居家生活', 0),
(6, '毛寵物', 0),
(7, '節慶道具', 0),
(8, '票券', 0),
(9, '彩妝品', 1),
(10, '保養品', 1),
(11, '眼部彩妝', 9),
(12, '上衣', 2),
(13, '下身', 2),
(14, '美食餐券', 8),
(15, '其他餐券', 14),
(16, '媽咪專屬', 4),
(17, '寶貝專屬', 4),
(18, '孕期護理', 16),
(19, '時尚孕媽咪', 16),
(20, '外出用品｜配件', 16),
(21, '嬰幼兒服飾', 17),
(22, '奶瓶｜奶嘴', 17),
(23, '安撫玩具｜玩偶', 17),
(24, '外出用品', 17),
(25, '彌月禮盒限定組', 17),
(26, '寵物用品', 6),
(27, '寵物食品', 6),
(28, '其他寵物用品', 6),
(29, '寵物配件', 26),
(30, '餐具/玩具', 26),
(31, '寵物床/外出籠', 26),
(32, '清潔/美容', 26),
(33, '貓砂/貓砂盆/墊', 26),
(34, '貓跳板/抓板', 26),
(35, '罐頭/鮮食', 27),
(36, '零食/肉乾', 27),
(37, '其他', 28),
(38, '配件', 2),
(39, 'T-shirt', 12),
(40, '襯衫', 12),
(41, '背心', 12),
(42, '外套', 12),
(43, 'POLO衫', 12),
(44, '裙子', 13),
(45, '褲子', 13),
(46, '帽子', 38),
(47, '圍巾/披肩/絲巾', 38),
(48, '鞋子', 38),
(49, '領帶/領結', 38),
(50, '臉部彩妝', 9),
(51, '唇部彩妝', 9),
(52, '化妝水', 10),
(53, '精華液', 10),
(54, '乳液乳霜', 10),
(55, '眼霜', 10),
(56, '其他臉部保養', 10),
(57, '身體保養', 10),
(58, '住宿券', 8),
(59, '飯店住宿券', 58),
(60, '民宿住宿券', 58),
(61, '享樂生活券', 8),
(62, '美容舒壓券', 61),
(63, '門票娛樂券', 61),
(64, '節慶佈置', 7),
(65, '節慶道具', 7),
(66, '節慶裝飾', 64),
(67, '桌上佈置', 64),
(68, '電腦週邊', 3),
(69, '行動週邊', 3),
(70, '相機/影像器材', 3),
(71, '藍牙喇叭/音響', 68),
(72, '鍵盤/鍵盤周邊', 68),
(73, '滑鼠/滑鼠周邊', 68),
(74, '耳機/耳機周邊', 69),
(75, '相機/相機周邊', 70);

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `sid` int(11) NOT NULL,
  `class` varchar(255) NOT NULL,
  `content` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `member`
--

CREATE TABLE `member` (
  `sid` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `birthday` date NOT NULL,
  `level` int(11) NOT NULL DEFAULT 1,
  `gift_voucher` int(11) NOT NULL DEFAULT 0,
  `public` int(11) NOT NULL DEFAULT 1,
  `register_date` date NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `mobile` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `member`
--

INSERT INTO `member` (`sid`, `email`, `password`, `birthday`, `level`, `gift_voucher`, `public`, `register_date`, `name`, `mobile`, `address`, `gender`) VALUES
(1, 'aaa123@fake.com', '$2y$10$pT0vbgjrCwNAYRvfcUcLAeggpdNHD7jpTwMzfFjrVAZnLP6yT9X3K', '1993-08-14', 1, 0, 1, '2022-09-19', 'KenKyou', '0973445889', '台北市大安區復興南路一段390號', 'male'),
(3, '', '$2y$10$pT0vbgjrCwNAYRvfcUcLAeggpdNHD7jpTwMzfFjrVAZnLP6yT9X3K', '1993-08-14', 1, 0, 1, '2022-09-19', 'KenKyou', '0973445889', '台北市大安區復興南路一段390號', 'male'),
(4, 'aaa123@aaa.com', '$2y$10$pT0vbgjrCwNAYRvfcUcLAeggpdNHD7jpTwMzfFjrVAZnLP6yT9X3K', '1993-08-14', 1, 0, 1, '2022-09-19', 'KenKyou', '0973445889', '台北市大安區復興南路一段390號', 'male'),
(5, 'aaa345@aaa.com', '$2y$10$pT0vbgjrCwNAYRvfcUcLAeggpdNHD7jpTwMzfFjrVAZnLP6yT9X3K', '1993-08-14', 1, 0, 1, '2022-09-19', 'KenKyou', '0973445889', '台北市大安區復興南路一段390號', 'male'),
(6, 'abc123@aaa.com', '$2y$10$pT0vbgjrCwNAYRvfcUcLAeggpdNHD7jpTwMzfFjrVAZnLP6yT9X3K', '1993-08-14', 1, 0, 1, '2022-09-20', 'KenKyou', '0973445889', '台北市大安區復興南路一段390號', 'male'),
(7, 'abc456@aaa.com', '$2y$10$Iv7wyRjZqY.ngB.nGibdduqW94DcK8r1iejvhY2kw9smYx698Hlra', '1993-08-14', 1, 0, 1, '2022-09-20', 'KenKyou', '0912345678', '台北市大安區復興南路一段390號', 'male'),
(8, 'eee123@eee.com', '$2y$10$HFiQMhzgcCPH0K1Zeos.5OAePHTuqXmwe8/9Ivo140yndC4U2C81a', '1991-08-12', 1, 0, 1, '2022-09-22', NULL, NULL, NULL, NULL),
(9, 'xxx111@xxx.com', '$2y$10$UtOWi8DJG5dx.vMAIrVSau8BeWOT2K.mZ7VRwZKcR08OkV6782uKW', '2004-03-03', 1, 2009, 1, '2022-09-22', 'Stacy', '0912123123', 'qwerrttyu', 'female'),
(10, 'zzz123@zzz.com', '$2y$10$E/ZbUPpgQTn6yH5OVqsWpOfFNdIxTrh79yMAbnxjE.q.qWuUDm/WK', '2004-12-01', 1, 0, 1, '2022-09-22', 'Monica', '0910111111', '台北市內湖區', 'female'),
(11, 'priscilla@fake.com', '$2y$10$TUkmCg9a0je6vsyPN3u8s.u3tz4YpsLSsky8Ala7c6rPsF8ipEdyK', '2004-09-26', 1, 0, 1, '2022-09-22', 'Priscilla', '0911000999', '台北市內湖區', 'female'),
(12, 'aaa123123@aaa.com', '$2y$10$xoHY0YijEZKKvkU5kKrhAeX1D0bgxVoOUTTjyYkVuHRfqgZgvTA/6', '1991-08-12', 1, 0, 1, '2022-09-22', NULL, NULL, NULL, NULL),
(13, '111@111.com', '$2y$10$KkQ8OjNyyu/ls4FCNnzd6OhJZ/znDYWDAi3SkyItJknYkdZpPsORG', '1993-07-12', 1, 0, 1, '2022-09-22', NULL, NULL, NULL, NULL),
(14, '222@222.com', '$2y$10$5/6dxeZQVRcnXXhzq2rVveis3NzbM3FqxDVrfO96UTguNK3a5.5om', '1991-11-22', 1, 0, 1, '2022-09-22', NULL, NULL, NULL, NULL),
(15, '333@333.com', '$2y$10$HIsWr5znGS9MAkBgJFvo/uuinAjO/2tS0cBObDYJ8f2F9nm8YM7MC', '1998-08-12', 1, 0, 1, '2022-09-22', NULL, NULL, NULL, NULL),
(16, '444@444.com', '$2y$10$BZBghPfPAj9JNbH7udCCS.otbH5KTCBiwBmqqsHqZnoYdTyRmXa0u', '1997-02-14', 1, 0, 1, '2022-09-22', NULL, NULL, NULL, NULL),
(17, '555@555.com', '$2y$10$JZ7WtgAVC6XwS.j9wOsrTuweqMySfPoXwQcZGVLIXX9v3U2GadAXm', '1997-02-08', 1, 0, 1, '2022-09-22', NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `member_coupon`
--

CREATE TABLE `member_coupon` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `coupon_sid` int(11) NOT NULL,
  `expiry_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `member_favorite`
--

CREATE TABLE `member_favorite` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `product_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `member_notice`
--

CREATE TABLE `member_notice` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `notice_sid` int(11) NOT NULL,
  `notice_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `notice`
--

CREATE TABLE `notice` (
  `sid` int(11) NOT NULL,
  `content` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `order_date` date NOT NULL,
  `delivery` varchar(255) NOT NULL,
  `orderer_name` varchar(255) NOT NULL,
  `orderer_mobile` varchar(255) NOT NULL,
  `orderer_tel` varchar(255) DEFAULT NULL,
  `recipient_name` varchar(255) NOT NULL,
  `recipient_mobile` varchar(255) NOT NULL,
  `recipient_tel` varchar(255) DEFAULT NULL,
  `address` varchar(255) NOT NULL,
  `pay` varchar(255) NOT NULL,
  `coupon_sid` int(11) NOT NULL,
  `gift_voucher_use` int(11) NOT NULL DEFAULT 0,
  `coupon_use` int(11) DEFAULT NULL,
  `freight` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `order_details`
--

CREATE TABLE `order_details` (
  `sid` int(11) NOT NULL,
  `orders_sid` int(11) NOT NULL,
  `product_sid` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `brand_sid` int(11) NOT NULL,
  `class_sid` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `intro` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`sid`, `name`, `brand_sid`, `class_sid`, `price`, `intro`) VALUES
(1, '全新一代 宛若新生撫紋霜 175ml', 1, 18, 2400, '●改善肌膚彈性，淡化身體紋路，輕盈乳霜質地容易延展，專業配方結合了活性成份，可改善肌膚彈性和緊實度，同時紓緩肌膚。\n●膚質：所有肌膚類型\n●質地：乳霜\n●使用說明： 在大腿、臀部、腹部和胸部畫圓按摩至吸收。'),
(2, '身體調和護理油 100ml', 1, 18, 2400, '●以冷壓淬鍊的第一道榛果油做為基底，以純植物萃取研製，配方融合了迷迭香、天竺葵和薄荷精油，讓肌膚更緊實有彈性，減少肌膚紋理的出現。\n●膚質：所有肌膚類型\n●質地：油\n●使用說明：每週2-3次，在濕潤肌膚上使用。取出小量護理油，塗遍全身或特殊部位輕柔地按摩。'),
(3, '無痕美體霜 150ml', 2, 18, 1260, '●溫和無香精、懷孕第1天開始使用，含多種營養素滋潤深入肌膚底層，恢復白皙、調理並淡化紋路\n●膚質：所有肌膚類型\n●質地：霜\n●.使用說明： 在大腿、臀部、腹部和胸部畫圓按摩至吸收。'),
(4, '彈力潤膚油 100ml', 2, 18, 1150, '●溫和無香精、懷孕第1天開始使用，含多種營養素滋潤深入肌膚底層，恢復白皙、調理並淡化紋路\n●所有肌膚類型\n●質地：油\n●使用說明： 在大腿、臀部、腹部和胸部畫圓按摩至吸收。'),
(5, '強效mamma美體撫紋霜 300ml', 7, 18, 1980, '●溫和荷荷芭油成分，滋潤保濕再升級，助於淡化細紋，搭配按摩效果更佳。\n●富含獨特50倍吸水性小分子蠶絲蛋白，成分親膚保濕效果更升級\n●豐富胺基酸成分，提供肌膚所需營養，自然散發健康光澤感\n●維生素E維護肌膚表層防禦力，舒緩孕期乾燥肌膚不適感'),
(6, '水洗襯衫式牛仔孕哺連身裙', 4, 19, 1680, '●彈性水洗棉丹寧布，舒適透氣，穿著合身不緊繃\n●寬鬆的版型剪裁，修飾下半身形，遮住臀部\n●半門襟開扣，兩側哺乳開口，隱密、好餵\n●材質：82%Cotton 16%Polyester 1%Spandex 1%Rayon\n●哺乳開口：門襟式-兩側腋下哺乳開口\n●洗滌方式：機洗/低溫/入袋/反面/不可浸泡/不可漂白/不可烘乾'),
(7, '背心+寬褲孕哺兩件式套裝', 4, 19, 1680, '●無束縛寬版兩件式套裝，垂墜面料，修飾身形\n●上窄下寬的剪裁設計，俐落又有型\n●雙側口袋、雙掀側哺乳開口，隱密版型，方便哺乳\n●材質：63%Polyester 32%Rayon 5%Spandex\n●哺乳開口：側開式-胸線哺乳開口\n●洗滌方式：機洗/低溫/入袋/反面/不可浸泡/不可漂白/不可烘乾'),
(8, '天堂的顏色 純白一字領五分袖孕婦洋裝 M', 5, 19, 1680, '●五分袖孕婦洋裝，輕薄貼身\n●春夏秋天皆合宜。產後也能穿\n●建議身型尺寸：\nS號： 身高 155~165cm，體重 45~55kg，適合胸圍 80~90cm\nM號： 身高 165~170cm，體重 55~65kg，適合胸圍 84~94cm\nL號： 身高 170~175cm，體重 65~75kg，適合胸圍 90~102cm'),
(9, '野餐好日子 綠底白點孕婦連身褲 S', 5, 19, 1380, '●草綠白點孕婦吊帶連身寬褲，後有拉鍊穿脫，雙口袋。\n●本款尺寸需考量胸圍：70cm內穿S號，85cm內穿L號\n●材質：100% 聚酯纖維\n●洗滌說明：．初次先以清水手洗，若有輕微染劑釋出為正常現象，請安心穿著。\n避免變形，建議手洗或放入洗衣網以低速短程洗滌。\n請勿使用漂白劑或深淺衣物一起洗滌，以免染色。\n請勿浸泡與烘乾，以免衣物縮水'),
(10, 'Audrey 一字領宴會純白孕婦連衣裙洋裝 S', 5, 19, 2180, '●喇叭袖、背領鬆緊帶。適合季節：春、夏、秋。\n●材質：100% 聚酯纖維\n●洗滌說明：初次先以清水手洗，若有輕微染劑釋出為正常現象，請安心穿著。\n避免變形，建議手洗或放入洗衣網以低速短程洗滌。\n請勿使用漂白劑或深淺衣物一起洗滌，以免染色。\n請勿浸泡與烘乾，以免衣物縮水'),
(11, '俏皮女生 黃色棉麻可調肩帶孕婦連身吊帶短褲 M', 5, 19, 780, '●棉麻孕婦吊帶短褲，吊帶為手調綁帶，胸前排扣，雙口袋。\n●適合產前產後孕婦連衣裙洋裝。\n●材質：50% 棉；50% 亞麻\n●洗滌說明：初次先以清水手洗，若有輕微染劑釋出為正常現象，請安心穿著。 \n避免變形，建議手洗或放入洗衣網以低速短程洗滌。 \n請勿使用漂白劑或深淺衣物一起洗滌，以免染色。 \n請勿浸泡與烘乾，以免衣物縮水'),
(12, '俏皮女生 綠色棉麻可調肩帶孕婦連身吊帶短褲', 5, 19, 780, '●棉麻孕婦吊帶短褲，吊帶為手調綁帶，胸前排扣，雙口袋。\n●適合產前產後孕婦連衣裙洋裝。\n●材質：50% 棉；50% 亞麻\n●洗滌說明：初次先以清水手洗，若有輕微染劑釋出為正常現象，請安心穿著。\n避免變形，建議手洗或放入洗衣網以低速短程洗滌。\n請勿使用漂白劑或深淺衣物一起洗滌，以免染色。\n請勿浸泡與烘乾，以免衣物縮水'),
(13, 'PCTO™ EBP 舒芙蕾多功能雙邊電動擠乳器組', 6, 20, 11520, '●36種吸力模式：最受期待的新一代客製化電動擠奶器\n●超級輕：重量只有230克 (約一顆蘋果重)\n●非常小：大小只有10公分 (約手掌大)\n●三用：可以單邊、雙邊、手動三用\n●四充：提供USB、電腦、家用電、行動電源4種充電方式'),
(14, '莫蘭迪純色後背媽媽包 燕麥奶', 3, 20, 3880, '●寬敞立體梯形大開口，掀蓋後自動向下固定，取物方便一目瞭然。 \n●舒適減壓背帶，內外多夾層設計，方便分類放置育兒物品\n●防水隔層，輕鬆隔開放置濕衣或髒物。 \n●行李箱固定帶設計，可固定套在行李箱拉桿上，不怕滑落。 \n●材質：100%綠色環保聚酯纖維(recycled Polyester)\n●尺寸：27x15x46cm\n●重量：840g'),
(15, '戶外走走機能後背媽媽包 珊瑚粉', 3, 20, 3580, '●兼​具戶外休閒與媽媽包多機能包款，束口大開口，隔層分明，方便分類放置育兒物品。\n●外層防水材質，透氣網袋與反光設計，。\n●舒適減壓背帶、透氣襯墊設計。\n●材質：100%綠色環保聚酯纖維(recycled Polyester)\n●尺寸：28x16x42cm\n●重量：850g'),
(16, '時尚完美大開口後背媽媽包 玫瑰金', 3, 20, 3780, '●超大容量硬挺大開口，取物方便一目瞭然。\n●雙肩後背帶可隱藏，背帶有減壓設計，可手提，側背及後背三種不同背法\n●防潑水抗污，具抗菌及防水功能，可放置易髒物品，易清理。\n●材質：100%綠色環保聚酯纖維(recycled Polyester) \n●尺寸：30x17x36cm \n●重量：1240g'),
(17, '恐龍佩佩豬月亮枕 喬治綠', 4, 20, 3780, ''),
(18, '傳承珍愛 經典初生套裝 0-3月', 8, 21, 1428, ''),
(19, '抱抱熊 連身衣＋口水肩套裝 0-3月', 8, 21, 448, ''),
(20, '嬰幼兒抗UV連身式泳裝 冰淇淋', 3, 21, 1280, ''),
(21, '嬰幼兒抗UV長袖泳裝上衣 仙人掌', 3, 21, 980, ''),
(22, '嬰幼兒抗UV短袖連身式泳裝 小福虎', 3, 21, 1680, ''),
(23, '小獅王辛巴 新生兒奶瓶超人氣體驗組', 10, 22, 1559, ''),
(24, 'PCTO™ 金色奇蹟PPSU多功能方圓型寬口奶瓶 330ml 雙瓶組', 6, 22, 1880, ''),
(25, '小獅王辛巴 桃樂絲夜光奶嘴配帶全能組', 10, 22, 259, ''),
(26, '小獅王辛巴 新生好拍嗝！桃樂絲PPSU寬口奶瓶6入組', 10, 22, 3059, ''),
(27, '小獅王辛巴 換瓶必備桃樂絲PPSU奶瓶大套組', 10, 22, 1909, ''),
(28, 'La Millou 安撫禮盒(豆豆安撫兔23cm二入組)', 9, 23, 1998, ''),
(29, 'La Millou 豆豆安撫巾 粉紫馬卡龍', 9, 23, 896, ''),
(30, 'La Millou 豆豆安撫巾 粉嫩薄荷綠', 4, 23, 896, ''),
(31, '豆豆安撫娃娃', 4, 23, 480, ''),
(32, 'La Millou 豆豆安撫兔加大 濃甜蜂蜜黃', 9, 23, 1380, ''),
(33, '兒童動物造型後背包 貓咪', 3, 24, 1080, ''),
(34, '兒童動物造型後背包 浣熊', 3, 24, 1280, ''),
(35, '小獅王辛巴 掰掰小黑蚊！植萃防蚊全方位大套組', 10, 24, 1099, ''),
(36, '小獅王辛巴 Classy高級訂製寬腰帶揹巾', 10, 24, 2800, ''),
(37, '薄荷巧克力育兒哺乳背巾', 4, 24, 1480, ''),
(38, '橘子泡泡糖育兒背巾', 4, 24, 1580, ''),
(39, '小獅王辛巴 巧虎成長禮盒', 10, 25, 1580, ''),
(40, '小獅王辛巴 蘿蔓晶鑽玻璃新生全配禮盒', 10, 25, 2049, ''),
(41, '小獅王辛巴 桃樂絲心願PPSU奶瓶禮盒', 10, 25, 1999, ''),
(42, '親膚天然有機棉寶寶新生兒禮盒 小熊玩偶', 5, 25, 1980, ''),
(43, 'Zoo 純棉動物園 滿月新生兒寶寶禮盒', 5, 25, 1680, ''),
(44, '抱抱熊 初生嬰兒床上用品套裝 0-3月', 8, 25, 3298, ''),
(45, '睡睡熊蠶寶寶抗菌包巾禮盒組', 4, 25, 1380, ''),
(46, '天然蠶繭T恤衫', 11, 39, 1320, '由乾手感棉麻材料製成的斗篷式襯衫。 \n寬鬆的 dolman 款式，打造不粘皮膚的輕鬆廓形。 \n它的下擺呈繭狀廓形，因此它很寬鬆，但腰部不會顯得臃腫。 \n袖長到肘部左右，是遮住手臂的絕佳單品。 \n寬鬆的袖子和寬度，易於穿著。'),
(47, '假疊層 T 短袖', 12, 39, 825, ''),
(48, '氣墊連帽衫短袖', 12, 39, 1485, '【材質/功能】 \n夏季氣墊已更新。 \n除了在炎熱的天氣裡帶來令人愉悅的涼爽感外，易乾易護理功能讓護理更輕鬆。 \n此外，材質美觀，質地光滑，更顯高貴典雅。 \n【設計】 \n寬鬆的廓形和連帽造型的設計美輪美奐，有今年獨有的多種顏色可供選擇。 \n[Styling] \n建議搭配修身褲裝，打造乾淨利落的造型。'),
(49, '油漆標誌 T恤', 13, 39, 1287, '在 NUMERALS 單品中，最受歡迎的 T 卹採用短袖設計。 \n這是一個帶有油漆設計的項目，給你一種活力感。 \n與普通的T卹不同，正面和背面的面料通過側邊面料連接起來，營造出立體的廓形。 \n使用柔軟的面料，您可以享受輕盈、略微緊實和緊實的質地和壓倒性的舒適感。'),
(50, '什錦色塊 T 卹', 13, 39, 1287, '一款設計感十足的T卹， \n廓形適中，穿著舒適。 \n每種顏色都在一個地方使用了面料，大膽的切換設計是一個有影響力的單品。 \n下擺、袖子、對角線、垂直 4 種色塊的組合式樣。'),
(51, '牛仔襯衫', 14, 40, 3630, '雖然身寬和長度較長，但這款牛仔襯衫 \n在領口、門襟和鈕扣之間有著微妙的平衡。 - 使用相當輕的8盎司牛仔材料 - 石頭生物漂白工藝將顏色減少到淡藍色。'),
(52, '365天我的風格襯衫', 12, 40, 1155, '每天都想穿的襯衫 \n【材質】 \nGLOBAL WORK原創TR材質，防皺，從秋冬開始就開始使用。 \n【設計】 \n從後背到下擺調整了喇叭口的量，更新了A字廓形，更顯女人味 \n我們有各種各樣的春天顏色，包括持久的顏色、瘋狂的圖案和隨機的條紋。'),
(53, '格紋襯衫', 15, 40, 2607, 'POINT\n[1] 使用靛藍線的原始格子圖案\n[2] 球生物處理的柔軟質感\n[3] 充滿復古感\n[面料]\n100% 棉細羅紋燈芯絨部分圖案原始格子使用靛藍紗線的襯衫。\n球生物處理賦予它復古的柔軟感。\n[設計]\n使用獨創的石頭狀圓點鈕扣，彰顯工作細節的襯衫。\n正面打開時可以看到的人字帶是休閒的設計點。\n它具有百搭的廓形，可用作罩子或內層，從秋季到早春都可以長時間穿著。'),
(54, 'Airy TR 開領襯衫', 16, 40, 957, '開領襯衫，廓形休閒。\n側面增加了一個開衩，營造出簡約而獨特的設計。\n【材質】\n超輕量TR材質。\n通過使用類似亞麻的線，它表現出像麻一樣的淡淡的結。\n您可以在保持乾淨外觀的同時體驗輕盈柔軟的舒適感。\n[造型]\n建議搭配同材質的下裝套裝。'),
(55, '摩爾條紋襯衫', 13, 40, 1617, '質感順滑且有存在感的襯衫。開領襯衫，帶有商場般的條紋圖案，給人以立體感。 \n通過使用具有拉絲感的商場結構，它具有不同的表情和氛圍。 \n您可以享受質地略有不同的日益流行的條紋襯衫。'),
(56, '什錦背心', 13, 41, 2145, '時尚高級背心，只需穿上 \n它 人造皮革和麂皮材質的什錦背心，非常適合秋季。 \n時尚簡約的款式加一。 \n我們還建議將它與由相同材料製成的褲子搭配。 \n---最好的人造 \n皮革絨面革什錦套裝'),
(57, 'V領彩色線條背心', 15, 41, 1617, '[1] 具有亞麻質地的材料，皮膚感覺很好 \n[2] 時尚V領背心 [3] 可以穿的單品作為設置[面料]一種柔軟的聚酯材料，具有亞麻般的質地，在皮膚上感覺良好。它很薄，所以你可以穿得很酷。【設計】深V領背心 今年流行的V領背心讓你好看。身體的寬度是堅實的，所以很容易分層。【造型】我們建議穿T卹或無袖層作為內層。同材質褲子搭配'),
(58, '光滑/彩色馬甲背心', 17, 41, 1947, ''),
(59, 'Eco Poly 針織背心', 18, 41, 2310, '▼ 設計 \nV領針織背心，人字形底邊用再生滌綸線編織 \n[設計/功能] \n帶有時尚的側開口，你可以打開或關閉它來搭配你的衣服。 \n它有多種鮮豔的顏色，後擺羅紋飾有色塊。 \n請享受健康模式的感覺。'),
(60, '絞花針織背心', 14, 41, 3590, '高抗衝粗紗粗紗手工編織。 \n因為每一件都是手工編織的，所以它具有獨特的質地和復古的設計。 \n使用100% 羊毛粗紗。 \n*因為每件商品都是手工編織的，所以尺寸和質地會有所不同。'),
(61, '蝙蝠羅紋短款束腰夾克', 19, 42, 4620, '這款短款束腰上衣\n帶有環形拉鍊。一款女性化的短款外套，可搭配\n緊湊 材質因顏色而異，黑色09是漂亮的緞面材質，成熟穩重，黑色其他10是仿皮，風格前衛。下擺可以用束帶收緊，讓您改變輪廓並穿著它。 此外，它還有一個反向拉鍊，可以從下擺側打開。它可以穿出乾淨的印象，因此可以搭配喇叭裙或闊腿褲。'),
(62, '拼接西裝外套', 20, 42, 2640, '[設計] \n以雙鈕扣為基礎設計的精裁夾克。 \n寬鬆的超大款時尚單品。 \n我們有 2 種純色，百搭百搭，還有流行的千鳥圖案。 \n這款產品可以搭配多種風格，從日常使用的外罩到辦公室 \n協調。'),
(63, '中號帳篷大衣', 21, 42, 6270, '想要優雅地穿著的休閒外套。長度適中，可以搭配任何下裝，深開衩不僅適合褲子，也適合裙子款式。 通過在袖口設置可以調節袖寬的腰帶，或者捲起袖子，建議您秀出手腕，讓您看起來更加成熟和放鬆。 -STYLING-卡其色建議搭配連衣裙等甜美單品，米色建議搭配緊身喇叭褲等利落褲裝。'),
(64, '襯衫夾克', 19, 42, 4290, ''),
(65, '燈芯絨立式拉鍊夾克', 17, 42, 2987, '■Silhouette\n寬闊的肩寬和寬闊的空間，打造出時髦的大廓形/oversized廓形。\n長度稍短，因此您可以享受層次感。\n■材質\n燈芯絨材質，具有光澤感和奢華感。\n在保留二手衣服質感的同時，也增添了RAGEBLUE獨有的優雅氣質。'),
(66, '無袖拼色 POLO 衫', 22, 43, 1485, ''),
(67, '短款 NYC 標誌橄欖球', 22, 43, 2685, ''),
(68, '常規版型條紋 POLO 衫', 22, 43, 2100, ''),
(69, '修身版 TOMMY POLO 衫', 22, 43, 1485, ''),
(70, '修身長袖拉鍊 POLO 衫', 22, 43, 1785, ''),
(71, '太空艙寵物背包', 23, 26, 1690, '輕便、通透、超易用的pidan寵物出行背包！\n● 前所未有大尺寸\n● 可背、可拎、還有拉桿箱專用綁帶\n● 折疊收納，花樣出行\n● 超大視窗\n● 頂面大孔徑透氣網格佈設計，拒絕悶熱！'),
(72, '犬用牽引繩三合一套裝', 24, 26, 980, '● 受力均勻 不勒脖子\n● 是牽引繩 也是背包\n● 安全溜寵 拒絕丟失'),
(73, '寵物居家服套裝', 25, 26, 890, '● 來一場陽光明媚的郊遊，獻上時髦的「度假Filters」！\n● 科技面料柔軟耐用\n● 後背抽繩可任意調節圍度\n● 撞色套裝設計增添時尚度'),
(74, 'Meri Meri 銀色條紋紙餐盤組（8入組）', 26, 67, 315, '✰ Let\'s go party! 派對必勝亮眼細節\n\n繽紛亮麗的餐盤紙杯、吸管，俏皮童趣的蛋糕裝飾，以貴氣熱情的金屬色為底，搭配星星、條紋等亮彩造型，呈現出活潑的熱鬧氛圍，適合在值得慶祝的時刻或是客人到訪使用，散發濃濃的歡樂氣息！'),
(75, 'Meri Meri 聖誕節綠森林裝飾（10入組)', 26, 66, 880, '這些樹狀裝飾可以作為精美的裝飾品放置在您的派對桌上或您的家中。\n它們由薄紙製成，每棵樹的頂部都有一顆星星，上面撒有銀色亮粉。'),
(76, 'Meri Meri 經典花紋聖誕樹紙盤（8入組）', 26, 67, 315, '聖誕樹是節日派對餐具的絕佳設計，尤其是當它們裝飾有令人愉悅的圖案時。\n每個聖誕樹形狀的紙盤都有不同的設計和顏色。'),
(77, 'Meri Meri 亮片星星花環', 26, 66, 880, '星星是一種絕妙的裝飾元素。\n這款花環非常適合為節日派對點綴華麗的風格。'),
(78, 'Meri Meri 綜合聖誕派對帽（6入組）', 26, 65, 690, '忘記樸素的派對帽吧，我們設計一套派對帽子非常適合節日拍照！\n每套包括6頂不同的帽子，上面有3D聖誕樹、冬青樹和禮物，全部採用紅色、綠色和金色等充滿節日氛圍的顏色。'),
(79, 'Meri Meri 森林夥伴花環', 26, 66, 820, '如果您想為您的派對增添民俗風格，非常適合秋季和感恩節，那麼您一定會喜歡這個華麗的花環！\n它設計精美，採用紙製動物、紙花和葉子製成，並附在令人驚嘆的格紋緞帶上。'),
(80, 'Meri Meri 森林夥伴杯子蛋糕套組（24入）', 26, 67, 565, '用這款精美的套組，將您的杯子蛋糕變成美妙的森林藝術品！\n這個套組共有8款樣式。\n它印有動物、帶有流蘇尾巴的鳥類和針葉林的圖案，並搭配格紋印花紙杯。'),
(81, 'Meri Meri 聖誕樹妝扮斗篷', 26, 65, 4230, '聖誕樹是聖誕節真正的亮點，現在您的孩子可以穿上我們精美的服裝假裝是其中一員！ \n它非常適合聚會，或在家中度過愉快而有趣的時光。 \n這款斗篷採用薄紗精心製作而成，含有大量裝飾，並配有閃亮的金色星星頭帶。'),
(82, 'Meri Meri 聖誕巢狀裝飾（16入）', 26, 66, 1255, '如果您希望您的聖誕裝飾品明亮而美麗，那麼您一定會喜歡這款精美的套組！\n它具有16種薄紙材質圖樣設計。'),
(83, 'Meri Meri 金色派對氣球（12入）', 26, 66, 220, '用這些氣球為任何特別的慶祝活動增添時尚的金色光芒。\n它們非常適合訂婚、婚禮、紀念日、派對和特別的生日等場合。'),
(84, 'Meri Meri 粉色派對氣球雲（14入）', 26, 66, 690, '這款漂亮的粉色氣球雲套組在任何派對上都會看起來非常棒！\n非常適合生日派對、週年紀念、婚禮、訂婚或周歲派對。\n套組內包括14顆氣球，其中三顆預先填入了華麗的五彩紙屑，以及三個閃亮的金色飄帶。\n氣球雲約有92公分高，看起來令人印象深刻。'),
(85, 'Meri Meri 英式花園派對組合', 26, 67, 1880, '如果您正在尋找漂亮的派對用品，那麼您一定會喜歡這款英式花園套組！\n它具有令人驚嘆的花卉圖案和金箔細節。\n您的客人一定會喜歡華麗的花環、餐具和帶有柔軟彩色絨球的迷人派對帽。'),
(86, 'Meri Meri 生日派對王冠（8入）', 26, 65, 625, '當您可以戴上設計精美的生日派對頭飾，上面覆蓋著閃閃發光的亮片時，為什麼還要戴樸素的生日派對帽？\n它們看起來簡直令人驚嘆，保證讓您的派對客人開心。\n這個組合包含8款樣式。'),
(87, 'Meri Meri 法式蕾絲圖樣餐盤（8入）', 26, 67, 265, '我們與餐廳、茶室和馬卡龍專家 Laduree 合作，打造這些精美的盤子。\n精緻的色彩、金箔設計和扇形邊框非常時尚。\n裡面包含8款顏色。'),
(88, 'Meri Meri 綜合彎扭蠟燭（20入）', 26, 67, 375, '這些彎曲的蠟燭在明亮的色調中，將為任何慶生蛋糕增添效果。\n點亮時它們看起來也很棒，讓所有派對客人感到開心。\n裡面包含5款樣式共20支蠟燭。'),
(89, 'Meri Meri 蝴蝶餐盤（8入）', 26, 67, 345, '蝴蝶是如此美麗，它們在這些蝴蝶餐盤上看起來非常棒！\n非常適合公主或童話派對、婚禮、週年紀念或訂婚。'),
(90, 'Meri Meri 小熊餐巾紙（20入）', 26, 67, 220, '為渴望冒險的人舉辦派對？\n使用我們的 Let\'s Explore 系列，為您的派對氣氛帶來一絲野性。\n這些可愛的小熊餐巾紙具有可愛的特徵和有趣的圓耳朵 —— 非常適合一群大自然愛好者！'),
(91, 'Meri Meri 金色葉子餐盤（8入）', 26, 67, 345, '樹葉和漿果是絕妙的節日派對主題，當設計採用閃亮的金箔時，看起來更加迷人。\n這些大餐盤非常適合主菜，也有令人賞心悅目的波浪形金色邊框。'),
(92, 'Meri Meri 紫丁香花卉吊籃', 26, 66, 1720, '這款花卉吊籃將柔和鮮豔的花朵與金箔細節完美結合，可以精美地改造房間。\n它非常適合春季派對或當您想要添加優雅華麗的風格時。'),
(93, 'Meri Meri 生日亮片頭飾', 26, 65, 785, '用這款令人驚嘆的頭飾讓生日壽星從人群中脫穎而出！\n它採用金線製成，上面用閃閃發光的字母拼出「生日快樂」字樣。'),
(94, '平衡修護奇蹟膠 Dramatically Different Moisturizing Gel', 27, 54, 1850, '肌膚類型混和肌, 非常油肌\n穩定膚況神隊友\n地表最強保濕屏障修護\n無油凝膠，還原油水平衡，倩碧經典天才小黃瓶， 清爽好吸收的凝膠質地，最適合敏感肌的保濕保養乳液 親膚鎖水配方，\n每天使用兩次，可藉由複製健康肌膚的油水平衡修護皮膚，重現光透潤澤'),
(95, '天才超緊無痕眼霜 Clinique Smart Clinical Repair Wrinkle Correcting Eye Cream', 27, 55, 2200, '專利抗老配方可減少細紋浮現。針對眼周不同類型紋路設計，4周緊緻眼周肌膚，撫平眼周細紋和暗沉，使眼周肌膚更年輕、\n更強壯、更明亮。無香精且不刺激，隱形眼鏡配戴者友好。'),
(96, '水磁場微分子保濕精華 Moisture Surge Hydrating Supercharged Concentrate', 27, 53, 1770, '適用於各種膚質\n\"清爽質地瞬間吸收，給予保水度爆棚的效果，不含油、無致敏成分，使用零負擔，給予肌膚最豐盈滋潤的呵護。\n創新的極輕爽凝露配方與濃縮抗氧化成分，立即提供 179% 的保濕效果。\n運用全新雙重作用的液體圓球科技 (Liquid-Sphere™Technology）及超保濕蓄水科技(Moisture Holding Super-Matrix)，\n讓每一滴精華都可以層層深滲透到肌底養成保濕蓄水池，使用24小時後，持續讓肌膚變得更保濕 61%。'),
(97, 'DITOO PLUS像素藍牙喇叭', 28, 71, 2280, '外觀設計向台個人電腦，無論是機械鍵盤和功能槓桿，皆具有很強的設計感：這不僅是向80後純真年代致敬，更將復古及科技元素連結，創造出美好的科技生活。'),
(99, 'Marshall Stanmore II 藍牙喇叭', 29, 71, 16700, 'Stanmore II是 Marshall 系列喇叭中，多方位適用任何空間大小的代表。強大的聲音表現，由精選原件組成，兩個 15 瓦 D 類擴大器驅動高音單體，加上一個 50 瓦 D 類擴大器驅動重低音單體，讓 Stanmore II 即使在最高音量，也能保有乾淨又精準的聲音。 透過藍牙藍牙 5.0 與 QualcommaptX™，無線狀態下也能體驗立體聲效。'),
(100, '溫和保濕水 CONFORT TONIQUE 400 ML', 30, 52, 2100, '溫和保濕水為乾性肌膚準備的凝狀保濕水。\n保濕化妝水內含植物性乳蛋白(蜂蜜+甜杏仁萃取)，能有效補給肌膚水份，舒緩清潔後產生的不適與緊繃感，恬適宜人的淡雅香氛，\n不刺激的質地，為乾性肌膚溫和地啟動之後保養品吸收的前導準備。\n凝狀水感化粧水，濕敷使用後溫和舒適，肌膚水潤飽滿。'),
(102, '超極光亮白保濕精華乳 BRIGHTENING REBALANCING WATERY EMULSION', 30, 54, 3000, '全新超極光亮白保濕精華乳！注入極光水珍稀天然成份「\n法國山毛櫸芽萃取」，能加速肌膚新生，使肌膚更加勻淨\n透亮。獨特水感質地，具備水乳液般的輕盈，卻擁有精華\n般的滋潤度。好吸收不黏膩，瞬間水潤保濕，加倍肌膚明\n亮效果。'),
(103, '絕對完美24K黃金玫瑰霜面膜', 30, 56, 6500, '延續絕對完美黃金玫瑰霜自上市以來口碑爆棚的的絕佳質地與超強修護滋養力，蘭蔻又獨家研發出了「24K金玫瑰霜面膜」，\n不僅一片富含整瓶玫瑰霜的活性能量，更搭載前所未見的24K金光璨複方與24K金導入材質，完美封存珍稀成分、超導修護肌底、完美貼合；\n只要20分鐘，肌膚立現持久奇蹟光！'),
(104, 'Marshall Emberton II 攜帶式 藍牙喇叭', 29, 71, 6490, 'Emberton II 所傳達的聲音豐富飽滿、乾淨且音量非凡。藉由真正的立體聲播放來體驗 360° 的音樂饗宴，每個角度聽起來都完美無瑕。\nEmberton II 還提供著同級產品中幾乎最大聲的音量播放。\nEMBERTON II 經過 IP67 認證，意味著它已被認證，可以防止灰塵或者微粒進入，也能經受 1 公尺深的靜水壓力。也就是說，如果您的 Emberton II 用髒了，不用擔心，直接沖洗它吧！當然，下雨也無需擔心。'),
(105, 'Audio Technica 鐵三角 AT-LP60XBT WH 全自動藍牙 立體聲 黑膠唱盤', 31, 71, 6500, '• 透過支援藍牙功能的喇叭或耳機，無線傳輸唱片樂音\n• 支援高音質且低延遲的 aptX 音訊編碼\n• 全自動播放型黑膠唱盤，按下 START 鍵就能播放/暫停，支援 33/45 轉\n• 鋁合金壓鑄成形唱片轉盤，再現清澈音質\n• 專用唱臂和唱頭蓋，提升唱針循軌能力並抑制多餘共振'),
(106, 'JBL - Horizon - USB充電和環境光的藍牙時鐘收音機', 33, 71, 5400, '帶LED燈的多感官鬧鐘\n為您和您的伴侶提供2個獨立鬧鐘。\n可以選擇FM廣播，原始數字鬧鐘音或從藍牙設備播放的音樂。\nLED環境光有助於輕輕喚醒您。\nLCD顯示屏會自動調節亮度以適合室內照明。'),
(107, '特潤超導全方位修護露 Advanced Night Repair Serum', 32, 56, 2950, '一滴完美透亮　肌膚彈潤更緊緻\n極速修護新革命　啟動年輕關鍵'),
(108, 'Leopold FC750RBT 藍牙雙模機械式鍵盤', 34, 72, 4530, '1、ABS外殼\n2、多媒體功能鍵\n3、PBT二色鍵帽\n4、德國CHERRY MX機械軸\n5、專屬自行開發衛星軸體\n6、可調整腳架設計及防滑墊\n7、雙層FR4 PCB & 底部消音棉設計'),
(109, '局部加強緊實凝膠', 35, 57, 2000, '清爽的局部加強緊實凝膠採用有機植物萃取而成，針對容易下垂鬆垮部位，包括手臂、臀部、大腿、腹部和腰部加強緊實。\n使肌膚更柔滑，更滋潤，重拾其自然彈性。\n質地清爽不黏膩，塗抹後即可穿上衣服。\n膚質： 混合性肌膚, 乾性肌膚, 一般肌膚, 油性肌膚\n質地： 凝膠\n使用說明： 每天早上和/或晚上使用。'),
(111, 'Ducky Zero 9108 芝芝桃桃 108鍵PBT機械式鍵盤', 37, 72, 2190, '1、全新配色設計\n2、多段式腳架設計\n3、獨立指示燈設計\n4、雙層電路板用料\n5、PBT二色成形不破孔鍵帽\n6、使用德國Cherry MX 機械軸\n7、USBType-C接頭與接線分離設計\n8、Ducky Macro 2.0，最強大的硬體設定功能'),
(112, '全新一代 宛若新生撫紋霜', 35, 57, 2400, '輕盈細滑的乳霜質地容易延展，專業配方結合了活性成份，可改善肌膚彈性和緊實度，同時紓緩肌膚。此外，配方成份極簡，包裝可確保配方的保鮮度。\n膚質： 所有肌膚類型\n質地： 乳霜'),
(113, 'Leopold FC900RBT藍牙雙模機械式鍵盤', 34, 72, 4680, '1、ABS外殼\n2、多媒體功能鍵\n3、PBT二色鍵帽\n4、德國CHERRY MX機械軸\n5、專屬自行開發衛星軸體\n6、可調整腳架設計及防滑墊\n7、雙層FR4 PCB & 底部消音棉設計'),
(114, '輕盈美體護理油', 35, 57, 2400, '護理油以純植物萃取研製，配方融合了金雀花、天竺葵和墨角蘭精油，幫助趕走不需要的負擔，讓肌膚更緊實有彈性。以冷壓淬鍊的第一道榛果油做為基底，讓肌膚如絲緞般柔軟。香氣帶來身心靈的愉悅享受。不留污跡。\n膚質： 所有肌膚類型\n質地： 油\n使用說明： 每週2-3次'),
(115, '牛奶果美胸霜-緊實', 35, 57, 2450, '越南牛奶果和鐵樹萃取成份，有效緊實胸部到下巴部位的肌膚，肌膚更加滋潤光滑、柔軟，保持青春！重拾緊實肌膚，使肌膚更滋潤光滑，如絲緞般柔軟。\n膚質： 所有肌膚類型\n質地： 乳液\n使用說明： 睡前使用。'),
(117, 'NZXT MXL900 布質滑鼠墊', 38, 73, 1290, '1、防汙塗層\n2、防滑加厚\n3、靜音吸震鼠墊\n4、柔軟便於攜帶的特性\n5、提升遊標精確定位與追踪性能\n6、針對紅外線與雷射滑鼠靈敏度及傳感器優化'),
(118, 'SteelSeries AEROX 3 Wireless Ghost', 39, 73, 2490, '1、完美像素 TrueMove Air 光學遊戲感應器\n2、AquaBarrier™ 技術具有防水防塵等多種機能\n3、絕佳 200 小時電池壽命，配以 USB-C 快速充電\n4、透過遊戲級 2.4 GHz 及多功能藍牙實現雙連接 5.0\n5、超輕量型設計，重量僅 68 克，讓您以輕鬆最快的速度遊戲'),
(119, '煥顏緊緻彈力精華水', 35, 52, 2100, '這款女神彈簧水適合所有膚質，結合天然植萃成分和長短鏈玻尿酸，為肌膚提供長達8小時的強效保濕*，同時喚活肌底，使肌膚重拾活力。其配方專門針對抗老，有助顯著緊緻肌膚，維持彈性豐潤。精華水還可以做為前導為肌膚打好基礎，快速吸收後續塗抹的保養品。絲滑柔潤質地可深入滲透肌底，讓肌膚感覺飽滿澎潤。其環保設計瓶裝採用至少25%再生塑膠。 \n膚質： 混合性肌膚, 乾性肌膚, 一般肌膚, 油性肌膚\n質地： 乳液\n使用說明： 每天早上和/或晚上使用。'),
(120, 'logitech MX Ergo', 40, 73, 3290, 'MX ERGO 是針對您的手型而特別打造，可快速精確地進行追蹤。具有獨特的 0 或 20° 傾斜角度，專為輕鬆征服冗長的文件和試算表而設計。'),
(121, '超級精華-黃金雙激萃', 35, 53, 4100, '克蘭詩首度破解肌膚的年輕密碼！了解唯一*蘊含 [20+1] 種高效植物精華的 [水+油] 配方護理，高效激活5大控齡修復關鍵。\n嶄新全面雙重配方結合天然成份：薑黃萃取、豐富的薑黃酮及20種高效植物精華，有效提升抗老功效。明顯減淡老化跡象，重拾肌膚光澤。\n膚質： 所有肌膚類型\n質地： 水狀'),
(122, '黃金亮眼萃', 35, 55, 2700, '為眼周的脆弱肌膚，精選有機高山峨參和黃金薑黃等13種植萃，注入獨創水乳雙質地，96%源於天然成份，\n全方位擊退眼周老化跡象，24H保濕抗乾紋、100%有感彈潤亮，一抹亮眼水光圈立現！\n膚質： 所有肌膚類型\n質地： 水狀\n使用說明： 每天早/晚由內而外輕按於全眼周。'),
(123, 'To Rev Up Tired Legs 漫步在雲端腿部舒緩霜', 41, 57, 1350, '薄荷、絲柏、歐薄荷和雪松能舒緩疲累的雙腿，釋放肌肉緊張與壓力，讓您的雙腿恢復活力與生氣。\n取適量由腳踝、小腿、大腿，由下往上單一方向按摩。\n成分:薄荷、絲柏、歐薄荷和雪松'),
(124, 'AZIO R.C.M.P. 義大利手工牛皮滑鼠墊(方形)', 36, 73, 1590, '1、植鞣頂級處理\n2、特殊防滑底層\n3、浮雕徽標壓印\n4、附可嵌式金屬環\n5、義大利進口頭層牛皮'),
(125, 'ORIGINAL SKIN 天生麗質粉美肌面膜', 41, 56, 980, '美肌面膜可重新撫平肌膚紋理，深層潔淨細緻毛孔，重現自然無瑕麗顏－拍照時無須再使用濾鏡。\n加拿大柳蘭改善肌膚暗沉，使肌膚更加明亮有光澤．\n地中海玫瑰泥淨化肌膚、柔滑膚觸，立現粉嫩細緻肌．'),
(126, 'AZIO R.C.M.P. 義大利手工牛皮桌墊滑鼠墊(摺疊式)', 36, 73, 4490, '1、摺疊式設計\n2、植鞣頂級處理\n3、特殊防滑底層\n4、浮雕徽標壓印\n5、附可嵌式金屬環\n6、義大利進口頭層牛皮'),
(127, 'Final Audio E3000', 42, 74, 1500, '・銀色不鏽鋼鏡面處理外觀\n・全新研發6.4mm動圈單體\n・華麗細緻的中高頻表現\n・配備獨家Type-E矽膠耳塞'),
(128, 'DR.WEIL青春無敵靈芝舒緩保濕噴霧', 41, 52, 1100, '靈芝噴霧和靈芝系列相同，成分添加珍稀的靈芝及北極靈芝發酵精萃，能立即調理不穩定的膚況，同時將成分快速吸收進肌底，\n其中更添加兩種高效保濕成分包含雪耳精粹，可以保存比自身重量多數倍水份的成分，以及靈芝水本身就含有的高效保濕成分-玻尿酸，\n就像海綿一樣能幫助肌膚喝保水保濕不乾澀！使用過程中能提振身心，因含有天竺葵、香橙、橘子、廣藿香及薰衣草精油，可放鬆療癒！'),
(129, 'Sony IER-M7', 43, 74, 19900, '・輕巧外殼\n・高規格聲音隔離\n・4 個平衡電樞式 (BA) 驅動單體\n・Sony 原創設計的 BA 驅動單體\n・預先成形的耳掛可以穩固貼合您的耳朵'),
(130, 'Beyerdynamic DT700 PRO X', 44, 74, 9400, '推出專為創作者打造的全新領域產品 PRO X 系列，力求滿足新一代創作者應用需求，以創作非凡為宗旨，承襲拜耳近百年來在音頻、聲學、會議演藝、航空等眾多領域的沉澱與積累，使得 PRO X 系列產品在技術、性能、靈活性方面推向新的高度。'),
(131, 'PLANTSCRIPTION™ 抗皺紋保養品：駐顏有樹全效修護精華', 41, 53, 3500, '全新升級配方、抗老再進化\n肌膚是否年輕的指標，在於肌膚天然的支撐架構是不是給力，膠原蛋白、彈力蛋白和原纖結構蛋白是3關鍵成分。\n但隨著年齡增長，原纖結構蛋白會減少而導致肌膚看起來鬆垮，使肌膚出現細紋與皺紋。\n天然高效保養專家品木宣言10年抗老修護科研再突破，從天然療傷藥材『榆綠木』中發現出神奇修護功效，\n搭配16種植物活性成分 & 6種有效胜肽，推出蘊含強大的抗老功效『駐顏有樹全效修護精華』，能有效提升3種膠原蛋白，1瓶對抗15種肌膚危機\n使肌膚從真皮到表皮建構密實飽滿肌底，更平滑緊緻有彈性。'),
(132, 'AKG K701', 45, 74, 6900, '不管您喜歡從整體上進行監聽，還是想要仔细聆聽分析，K701 都能將洞察力轉變成纯粹的享受。AKG 是全球第一家在耳機上使用革命性扁線音圈技術的製造商，這款耳機就是 K701。\nK701 可提供真正精緻化的音色，使每位音樂人都能找到精準定位。這種靈敏度和空間感，再加上精彩的高音柔和感、富有衝擊力的低音，堪稱業界奇跡。這款極致的開放式動圈耳機，提供出色的精準聲音和超卓的聲場。'),
(133, 'Sennheiser IE400 PRO', 46, 74, 11900, 'IE 400 PRO提供工作室音效的動態入耳式監聽耳機：顯著力度、清晰高頻以及通透的中音域重現。微型 7mm 驅動器採用新開發的 TrueResponse 技術，可確保無雜訊和無失真的音效。IE 400 PRO 採用符合人體工程學的設計，舒適穩固且堅固耐用，可適用於任何場合。'),
(134, 'Kodak Ektar H35', 48, 75, 1990, '柯達Kodak Ektar H35半格底片相機，是非常好入手適合想要降底片拍攝成本的人, 可讓您在35 mm的底片上產翻倍的畫面，絕對是現今底片成本飆升的時代，最好的節省好辦法。 此款相機內建閃光燈, 輕巧的機身，擁有四種顏色, 是適合旅行或任何社交場合的理想相機。'),
(135, 'Biotherm 碧兒泉 男仕 海鹽控油收斂水', 47, 52, 1650, '收斂化妝水推薦 - 男性海鹽控油收斂水能有效鎮定舒緩，收斂緊緻毛孔\n火山珍珠岩礦物質粉末成分搭配控油化妝水雙層質地、雙重功效，能有效吸附皮膚多餘油脂，改善毛孔粗大\n油水平衡，全天不泛油光\n內涵海鹽精華礦泉水，有效穩定肌膚'),
(136, 'Biotherm 碧兒泉 男仕 活泉多水72H超保濕凝露', 47, 54, 2450, '72小時沁涼保濕、清爽無極限\n第一瓶來自冰河的男性保濕凝露\n含獨家專利成分奇蹟活源因子\n含極地冰河鎖水因子：強化肌膚自體保水力，72小時長效保濕\n含獨家專利活性成分：能舒緩肌膚，使用兩週促進肌膚角質層代謝'),
(137, 'Biotherm 碧兒泉 男仕 長效控油海鹽潔面膠', 47, 56, 1300, '徹底臉部清潔，從肌底開始調理\n添加純植物性荷荷芭天然去角質微粒，深度清潔臉部肌膚\n具有高度親膚性，360度按摩肌膚，溫和調理代謝角質並助於控油，洗後清爽不緊繃\n適合敏感性肌膚使用\n肌底調理 徹底清潔\n溫和代謝角質 不油不緊繃'),
(138, 'Biotherm 碧兒泉 奇蹟活源晶透露', 47, 52, 2250, '妝前保濕精華推薦\n獨特的輕透水感質地，輕盈好吸收不黏膩，秒速滲透肌底\n搭配碧兒泉最高濃度的明星成分-奇蹟溫泉活萃，幫助活化與修護肌底\n搭配晶透亮膚因子加速肌膚角質層的修護、代謝老廢角質與緊緻毛孔\n使用後讓肌膚全面升級，閃耀細緻的晶透亮感\n輕盈好吸收不黏膩，加速肌膚角質層修護'),
(139, 'Biotherm 碧兒泉 奇蹟特嫩精華', 47, 53, 3200, '奇蹟益生活萃：改善不平滑粗糙顆粒感，粗糙-57%，超滑嫩\n維他命C配醣體+角質淨化因子：抑制黑色素生成，加速對抗肌底暗沉，讓肌膚由內而外白皙透亮，透亮感+31%，更發光\n大小分子玻尿酸：深入肌底注入保濕能量，撐起紋路讓肌膚水潤保濕，舒緩乾燥毛孔，毛孔收斂18%，超細緻\n「拯救暗沉粗粗臉，亮出健康水嫩肌」\n3大成分超級功效 ，打擊3大暗沉粗粗臉問題\nKO近距毛孔/壓力暗沉/T字顆粒'),
(140, 'KODAK M35 Film Camera', 48, 75, 750, '■簡單操作、輕鬆上手\n■入門玩家首選，價格親民\n■簡約風格、時尚文青\n■支援135(24x36mm)規格之所有底片\n■內建閃燈，自動充電\n■標準31mm定焦鏡頭\n■全程手動過片、回捲，復古玩法'),
(141, 'LOMO INSTANT AUTOMAT SUNDAE KIDS', 49, 75, 6980, '來自泰國的人氣插畫家 Sundae Kids 以可愛調皮又多彩的卡通漫畫風，繪畫出每個愛情中的大小事，引起讀者的共鳴，並於各大社交網站平台，擁有超過百萬來自世界各地的粉絲！這次 Sundae Kids 與 Lomography 推出獨家設計限量版的 Lomo’Instant Automat 拍立得'),
(142, 'Kiehl’s 契爾氏 激光極淨白淡斑精華', 50, 53, 3550, '史上最強美白精華液！一滴三效:極淡斑、超透亮、好保濕\n美白精華液三大成分\n三大有效成分「激光活能C」、「普拉絲鏈」、「溫和水楊酸」， 能有效淨膚拋光、淡化黑色素、偕同肌膚膠原蛋白作用，讓肌膚更保濕、更白皙透亮\n美白精華液專利\n專利配方有效又安心，穩定性高的保養成分白天擦也不怕變質，經實驗證實敏感肌也適用．\n每天早晚於化妝水後使用，建議一次用量為一整個滴管，均勻塗抹於臉部並將多餘的精華液帶到頸部。專利配方質地清爽，能快速吸收，立即有感透亮．'),
(143, 'RICOH THETA SC2', 51, 75, 10900, '為每個人設計的360°相機。\n能讓您輕鬆享受高性能的標準機型。'),
(144, 'Kiehl’s 契爾氏 冰河醣蛋白保濕霜', 50, 54, 1500, '千萬口碑推薦No.1保濕舒緩霜! 輕盈不致粉刺，3秒舒緩乾燥，具有長效保濕、水嫩亮效果\n●擁有南極純淨冰河配方，能幫肌膚抓水鎖水，達到24小時保濕水亮效果\n●添加修護天王神經醯胺衍生物，能快速舒緩泛紅、脫皮、乾癢、粗糙、緊繃和暗沉，效果看得見\n●不致粉刺配方，成分溫和、無添加酒精、香精、PARABEN防腐劑，敏感肌適用\n冰河醣蛋白保濕霜適用於每日早晚臉部清潔後，於化妝水或精華液後使用，取約3-5顆米粒大小保濕霜的量，點在臉頰與下巴部位，由臉頰開始均勻塗抹至T字部位。'),
(145, 'SONY ZV-1', 43, 75, 19380, '● 24-70mm，F1.8-2.8 變焦鏡頭\n● 0.03 秒高速自動對焦\n● 錄影支援人眼偵測自動對焦/即時追蹤\n● 錄影柔膚效果、臉部優先自動曝光\n● SteadyShot™積極模式\n● 一鍵切換背景景深、產品展示(開箱)模式\n● 內建三組麥克風、支援麥克風插孔'),
(146, 'Kiehl’s 契爾氏 超進化全能新生超級眼霜', 50, 55, 2000, '專櫃抗老眼霜推薦-眼部保養新革命！契爾氏全新輕脂超級眼霜，能有效緊緻拉提眼周，全面撫平眼周細紋、眼周暗沉、舒緩泡泡眼，60%少油配方、質地輕盈無負擔。\n●富含獨家專利300%*高效抗老濃度成份「普拉斯鏈」，協同膠原蛋白作用，由內而外層層緊緻、全眼有感拉提。\n●添加「雙重胜肽」，有效強化眼部肌底結構、提升肌膚彈力、精準淡紋更緊實。\n●60%**少油配方、好推好吸收！無添加香精、輕盈無負擔，敏感性肌膚也適用，早晚都可安心使用。'),
(147, 'Kiehl’s 契爾氏 金盞花精萃修護水凝凍膜', 50, 56, 1800, '●專櫃第一瓶【安瓶級水凝凍膜】，急救肌膚問題快又有效！\n●水凝凍膜注入金盞花瓣5大活萃成份，一敷立即修護舒緩，KO皮膚乾燥、皮膚暗沉、泛紅、膚色不均等問題，敷後肌膚變得更彈嫩細緻，透出水亮光澤！\n●獨家「水凝凍膜」質地，結合保濕凍膜的清爽質地與晚安水凝膜的保濕力，能緊密貼合肌膚，深層注入精華成份，保濕舒緩效果更持久！\n將保濕水凝凍膜塗抹於清潔過後的肌膚上，避開眼周肌膚，於臉部停留5-10分鐘，以溫水洗淨。可視肌膚需求每週使用水凝凍膜1-3次。'),
(148, 'Elizabeth Arden 伊麗莎白 時空彈力3D FIT 眼霜組', 52, 55, 2400, '●秒收緊：分子釘增強肌膚屏障、四胜肽提高肌膚密度讓肌膚更緊緻\n●深補水：紅海藻幫助鎖住水份提供全天候保濕\n●提輪廓：雪絨花精萃有助讓輪廓更立體，一掃鬆弛老態，同時改善膚色，綻放年輕活力'),
(149, 'Elizabeth Arden 伊麗莎白 時空彈力3D FIT緊容晚霜', 52, 54, 3750, '●秒收緊：分子釘增強肌膚屏障、四胜肽提高肌膚密度讓肌膚更緊緻\n●深補水：紅海藻幫助鎖住水份提供全天候保濕\n●提輪廓：雪絨花精萃有助讓臉部輪廓更立體，一掃鬆弛老態，同時改善膚色，綻放年輕活力\n質地清爽，吸收快速，使用後肌膚明顯緊緻、保濕、透亮，散發如絲綢般耀眼細緻的年輕光彩。\n運用分子釘、四胜肽和雪絨花萃取等保養成分，短短1週，肌膚明顯拉提緊緻，輪廓線清晰可見，重建V型小臉。'),
(150, 'M.A.C 超持妝全能氣墊粉餅SPF 50/PA++++', 53, 50, 2020, '殺手氣墊賜你超殺顏值，輕鬆斬除肌膚所有瑕疵！強勢持妝24小時，給你超清爽的霧絲絨妝感！\n直接用於臉部，或用臉部刷具打造更細緻的妝容'),
(151, 'M.A.C 彈力氣墊蜜粉', 53, 50, 1470, '專業品質，精緻的散粉，以啞光效果訂製霧面妝感。 添加滋潤成分，讓肌膚感到舒適不乾燥。擁有清透遮瑕力的彈力氣墊蜜粉是一款初學者必備的萬用底妝。\n以170或167刷具輕輕掃過全臉。\n若要打造更絲絨平滑的妝感，以Luxury Powder Puff拍於全臉。'),
(152, 'M.A.C 奇幻花園系列-時尚專業唇膏', 53, 51, 850, '以盛開的伊甸花園作為創作靈感，M·A·C推出全新限量奇幻花園系列，全系列含12色眼影盤、4款時尚專業唇膏以及2款超激光炫彩餅限量新色，\n包裝以夢幻柔美的神祕紫綴上斑斕花園色彩，邀您走進百花齊放的盛夏繽紛之中，彷彿置身夢幻芬芳的人間仙境。'),
(153, 'M.A.C 九色眼影盤-BURGUNDY TIMES', 53, 11, 1720, '精心嚴選的勃根地色調眼影盤，可提供無數的色調組合。它提供了一系列從霧面、緞面到珠光的紋理，可打造各種白天和夜晚的造型。\n飽和柔軟和光滑色調全被包裝成口袋大小的眼影盤，方便攜帶。\n使用方法:用手指、刷子或海綿用於眼部。'),
(154, 'M.A.C 3D無設限睫毛膏防水版', 53, 11, 900, '極黑超立體睫毛膏從睫毛根完整塗刷至尾端，刷出纖長、勾勒立體睫毛，現在更升級防水配方。\n更濃密纖長，打造捲翹持妝的誇張睫毛，不結塊、不暈染的超立體睫毛，升級防水配方，能抵抗濕氣。\n使用方法：將刷頭頂住睫毛根部，接著從根部往頂部晃動刷頭。重複塗刷，直到達到理想效果。'),
(155, 'M.A.C 魔幻魅惑系列-晶亮魔唇', 53, 51, 850, '挑起你的玩色癮頭 捲入迷幻彩妝漩渦\n高調宣告派對女王霸氣回歸\n# MAC魔幻魅惑系列'),
(156, 'YSL 情挑誘光水唇膏', 54, 51, 1470, '將所有雙唇需要的保養精華，一次注入這支極為柔潤保濕的唇膏中，讓女人每次使用唇膏，都享有無比舒適的潤澤感受與豐唇效果。'),
(157, 'YSL 恆久完美無瑕持妝粉底', 54, 50, 2600, '奢華浮刻LOGO X 獨家持妝科技\n底妝夢幻逸品\n全新持妝鎖水薄膜結合奈米遮瑕粒子\n讓肌膚內部油水平衡，外部防水抗汗不沾染\n同時針對肌膚瑕疵完美遮瑕，反覆堆疊仍能維持輕盈妝感，彷若天生零瑕疵的細膩妝感\n不論油肌 乾肌 24H都能擁有無瑕美肌*\n實現真正的底妝自由'),
(158, 'YSL 訂製奢華皮革彩妝盤', 54, 11, 3600, 'YSL訂製奢華皮革彩妝盤【Paris款】，金屬光到粉霧閃爍的多變質地，從日常妝容到夜晚狂歡派對造型，盡情訂製自己的美麗遊戲規則，無論何時何地都是最耀眼的焦點。'),
(159, 'Bobbi Brown 芭比波朗 冬蟲夏草精華亮膚持妝乳 SPF 25 PA++', 55, 50, 1950, '提亮氣色、煥活能量：添加冬蟲夏草+人蔘精華，為肌膚補充一整天滿滿活力！\n舒緩肌膚、減緩乾燥泛紅問題：紅海藻+甘草根萃取可穩定舒緩肌膚，維持健康狀態\n長效保濕、散發彈潤光彩：小麥蛋白及玻尿酸立即潤澤肌膚，水潤效果持續一整天\n強化肌膚防護、強健膚質：SPF防護及維他命E，保護肌膚抵禦紫外線、環境造成肌膚老化的傷害\n所有膚質適用'),
(160, 'Bobbi Brown 芭比波朗 流雲持久防水炫彩眼影筆', 55, 11, 1250, '不需刷具，也能完成眼妝。\n高度顯色，柔和或高調眼妝都能打造。\n八小時的防水功能及持久度，不易脫色。\n塗抹於眼皮上，以指尖輕易地暈染。或使用膚色色號打底，奪目色號提亮眼妝。'),
(161, 'Bobbi Brown 芭比波朗 晶鑽桂馥修護潤唇精華', 55, 51, 1300, '芭比波朗 晶鑽桂馥護唇家族再添生力軍\n全新晶鑽桂馥修護潤唇精華 美唇救援神登場\n能夠長達24HR修護滋養雙唇，有助改善唇部乾燥細紋，使雙唇長時間柔嫩健康\n塗抹後立即感覺唇部肌膚深度滋潤感、使用一周後唇部更加豐潤立體！\n用於唇膏後，能使唇部更顯澎潤、唇彩更顯色、同步強化唇部防禦力'),
(162, 'Bobbi Brown 芭比波朗 彷若裸膚蜜粉餅', 55, 50, 2000, '半透明的光澤蜜粉，細緻又自然，這款極度柔和的半透明粉餅含有天然的亮膚植物成分和反光粉末，能為肌膚打造由內而外綻放的光澤。 \n獲得Glamour雜誌頒發「2017年最佳美妝獎」\n多種色號能以不同光澤程度的珠光顏料校正膚色，打造自然明亮效果。此外，配方內含桑椹、葡萄和黃岑萃取。\n若要打造出整體光澤感，用斜角輪廓刷（分開販售）的扁平面將粉掃在全臉上。若要打造出細緻打亮感，用刷子的瘦窄面將粉刷在臉部凸起處。'),
(163, 'CHANEL 香奈兒斜紋軟呢四色眼影', 56, 11, 3210, '「香奈兒斜紋軟呢四色眼影」將斜紋軟呢布料交織的質地幻化為浮雕圖騰，四款色調和諧譜奏，收藏於同色系的斜紋軟呢收納袋內。\n每款限量收納袋皆由香奈兒 Lesage 刺繡工坊精心打造，更顯別出心裁、值得珍藏。\n四款珍藏版限量新作，色彩飽和的四款眼影結合柔霧、緞光與金屬光質地，完美勾勒由柔和到精細深邃的璀璨眼妝。'),
(164, '香奈兒COCO星綻唇膏', 56, 51, 1370, '閃耀新星：香奈兒COCO星綻唇膏，飽滿顯色、豐潤雙唇且持久舒適。\n香奈兒COCO星綻唇膏，一抹飽滿顯色透出水潤光澤。\n香奈兒實驗室研發出首款兼具保濕與豐潤效果的唇膏，專利配方，飽滿顯色，持續綻放完美亮澤。\n直接將唇膏塗抹於雙唇上\n數秒內，配方隨即轉化，綻放耀眼亮澤。'),
(165, '【西堤牛排】$658套餐(即享券)', 57, 14, 658, '平/假日適用，假日不加價\n兌換期間自發出日起算三個月'),
(167, '【星巴克】電子飲料券$150(可折抵至$170飲料)', 58, 14, 150, '$170飲品任選★假日不加價\n兌換期間自發出日起三個月有效\n無負擔輕鬆買★未用可退'),
(168, '【YOUBON】墾丁凱撒大飯店發現西餐廳自助式晚餐券(大假日+100)', 59, 14, 909, '西式燒烤、當季海鮮、日式料理\n蔬果沙拉吧、手工甜點\n開放式廚房，分區獨立餐檯'),
(169, '【Movenpick 莫凡彼】平日雙人英式下午茶組(含2層歐式點心盤+飲料x2)', 60, 14, 499, '全台逾20家分店適用\n姊妹/好友聚餐首選\n美味下午茶好滿足');

-- --------------------------------------------------------

--
-- 資料表結構 `product_style`
--

CREATE TABLE `product_style` (
  `sid` int(11) NOT NULL,
  `product_sid` int(11) NOT NULL,
  `size` varchar(255) DEFAULT NULL,
  `color` varchar(255) DEFAULT NULL,
  `gender` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `tag`
--

CREATE TABLE `tag` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `tag_rel`
--

CREATE TABLE `tag_rel` (
  `sid` int(11) NOT NULL,
  `product_sid` int(11) NOT NULL,
  `tag_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `trevi`
--

CREATE TABLE `trevi` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `brand_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `brand`
--
ALTER TABLE `brand`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `class`
--
ALTER TABLE `class`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `member_coupon`
--
ALTER TABLE `member_coupon`
  ADD KEY `member_sid` (`member_sid`),
  ADD KEY `coupon_sid` (`coupon_sid`);

--
-- 資料表索引 `member_favorite`
--
ALTER TABLE `member_favorite`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `member_sid` (`member_sid`),
  ADD KEY `product_sid` (`product_sid`);

--
-- 資料表索引 `member_notice`
--
ALTER TABLE `member_notice`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `member_sid` (`member_sid`),
  ADD KEY `notice_sid` (`notice_sid`);

--
-- 資料表索引 `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `order_details`
--
ALTER TABLE `order_details`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `orders_sid` (`orders_sid`),
  ADD KEY `product_sid` (`product_sid`);

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `brand_sid` (`brand_sid`),
  ADD KEY `class_sid` (`class_sid`);

--
-- 資料表索引 `product_style`
--
ALTER TABLE `product_style`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `product_sid` (`product_sid`);

--
-- 資料表索引 `tag`
--
ALTER TABLE `tag`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `tag_rel`
--
ALTER TABLE `tag_rel`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `product_sid` (`product_sid`),
  ADD KEY `tag_sid` (`tag_sid`);

--
-- 資料表索引 `trevi`
--
ALTER TABLE `trevi`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `brand`
--
ALTER TABLE `brand`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `class`
--
ALTER TABLE `class`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=76;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupon`
--
ALTER TABLE `coupon`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member`
--
ALTER TABLE `member`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member_favorite`
--
ALTER TABLE `member_favorite`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member_notice`
--
ALTER TABLE `member_notice`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `notice`
--
ALTER TABLE `notice`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `orders`
--
ALTER TABLE `orders`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order_details`
--
ALTER TABLE `order_details`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=170;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_style`
--
ALTER TABLE `product_style`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `tag`
--
ALTER TABLE `tag`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `tag_rel`
--
ALTER TABLE `tag_rel`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `trevi`
--
ALTER TABLE `trevi`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
